; Unicode File: "11-11. VietAnh Word with free marking (Type Viet and English & Correct spelling).ini"
[General]
Format Version=2
[Notes]

 
; --------------------------------------------------------------------------------------------------------------------- 
; Depending on the GUI language WinVNKey will choose the appropriate 
; info below to display when users click on menu "Get File Info" or "Set File Info". 
; 
; Tùy theo ngôn ngữ giao diện mà WinVNKey sẽ hiển thị các thông tin thích hợp 
; dưới đây khi người dùng chọn menu "Xem thông tin về tệp" hoặc "Thay đổi thông tin về tệp". 
; ---------------------------------------------------------------------------------------------------------------------

[For English GUI]
; Name to be displayed in combobox when users use English. If empty, use base filename:
Display name=
; Display information if not empty:
Information=
; Display the hyperlink for help on this file, if any (link must begin with "http://")
Help URL=http://

[For Vietnamese GUI]
; Tên dùng để hiển thị trong combobox khi dùng giao diện tiếng Việt (nếu để trống, dùng tên tệp).
Display name=11. Từ Việt Anh kiểu tự do (Gõ từ Việt và Anh -- sửa chính tả)
; Hiển thị hộp chữ "Mô tả"
Information=
; Hiển thị liên kết hướng dẫn về tệp này (địa chỉ website, nếu có, phải bắt đầu bằng "http://")
Help URL=http://
; xxxxxxxxxxxxxxx Don't delete this line!!! xxxxxxxxxxxxxxxxx


[Viet-Options]

SmartTyping=yes
TypeOption=2
CombineOption=2
AutoChange=yes
ChangeSyllable=no
Syllable correction=yes
Uncombine Syllable=yes
Word correction=yes
Uncombine Word=yes
Delay echo=no

[Autochange]

Change q->qu=yes
Correct beginning c/k=yes,1
Correct beginning g/gh=yes,1
Change f->ph=yes,1
Change z->gi=yes,1
Change i->y=no,0
Change y->uy=no,0
Change ya->uya=no,0
Change yc->uych=no,0
Change ye->uyê=no,0
Change yh->uynh=no,0
Change yn->uyên=no,0
Change yt->uyêt=no,0
Change yu->uyu=no,0
Autochange ic->ich=yes,1
Autochange ending k->ch=yes,1
Autochange ending g->ng=yes,1
Autochange ending h->nh=yes,1
Autochange ae=no
Autochange ii=no
Autochange yy=no
Autochange ou=no
Autochange uq=no
Autochange uv=no
Autochange uz=no

[Change Sylables]

Change endings ch, nh, ng=yes
ending choice index=0
..chn -> nh=yes
..nhc -> ch=yes
..ngh -> nh=yes
..nhg -> ng, ..chg -> ng=yes

Change syllables starting with a=yes
a choice index=0
a.. + c -> ac, anhc->ach=yes
a.. + i -> ai=yes
a.. + m -> am=yes
a.. + n -> an, achn->anh=yes
a.. + g -> ang=yes
a.. + h -> anh=yes
a.. + o -> ao=yes
a.. + p -> ap=yes
a.. + t -> at=yes
a.. + u -> au=yes
a.. + y -> ay=yes

Change syllables starting with ă=yes
ă choice index=0
ă.. + c -> ăc=yes
ă.. + m -> ăm=yes
ă.. + n -> ăn=yes
ă.. + g -> ăng=yes
ă.. + h -> anh, ăch->ach=yes
ă.. + p -> ăp=yes
ă.. + t -> ăt=yes

Change syllables starting with â=yes
â choice index=0
â.. + c -> âc=yes
â.. + m -> âm=yes
â.. + n -> ân=yes
â.. + g -> âng=yes
â.. + h -> anh, âch->ach=yes
â.. + p -> âp=yes
â.. + t -> ât=yes
â.. + u -> âu=yes
â.. + y -> ây=yes

Change syllables starting with e=yes
e choice index=0
e.. + c -> ec, enhc->êch=yes
e.. + m -> êm=yes
e.. + n -> ên, echn->ênh=yes
e.. + g -> eng=yes
e.. + h -> ênh=yes
e.. + o -> eo=yes
e.. + p -> ep=yes
e.. + t -> et=yes
e.. + u -> êu=yes

Change syllables starting with ê=yes
ê choice index=0
ê.. + c -> êc, ênhc->êch=yes
ê.. + m -> êm=yes
ê.. + n -> ên, êchn->ênh=yes
ê.. + g -> eng=yes
ê.. + h -> ênh=yes
ê.. + o -> eo=yes
ê.. + p -> êp=yes
ê.. + t -> êt=yes
ê.. + u -> êu=yes

Change syllables starting with iê=yes
iê choice index=0
iê.. + c -> iêc=yes
iê.. + m -> iêm=yes
iê.. + n -> iên=yes
iê.. + g -> iêng=yes
iê.. + p -> iêp=yes
iê.. + t -> iêt=yes
iê.. + u -> iêu=yes

Change syllables starting with i=yes
i choice index=0
i.. + a -> ia=yes
i.. + c -> ic, inhc->ich=yes
i.. + m -> im=yes
i.. + n -> in=yes
i.. + h -> inh=yes
i.. + p -> ip=yes
i.. + t -> it=yes
i.. + u -> iu=yes

Change syllables starting with oa=yes
oa choice index=0
oa.. + c -> oac, oanh+c->oach=yes
oa.. + i -> oai=yes
oa.. + m -> oam=yes
oa.. + n -> oan, oachn->oanh=yes
oa.. + g -> oang=yes
oa.. + h -> oanh=yes
oa.. + o -> oao=yes
oa.. + p -> oap=yes
oa.. + t -> oat=yes

Change syllables starting with oă=yes
oă choice index=0
oă.. + c -> oăc, oănhc->oach=yes
oă.. + m -> oăm=yes
oă.. + n -> oăn=yes
oă.. + g -> oăng=yes
oă.. + h -> oanh, oănh->oanh=yes
oă.. + p -> oap=yes
oă.. + t -> oăt=yes

Change syllables starting with oe=yes
oe choice index=0
oe.. + o -> oeo=yes
oe.. + n -> oen=yes
oe.. + t -> oet=yes

Change syllables starting with o=yes
o choice index=0
o.. + a -> oa=yes
o.. + c -> oc=yes
o.. + e -> oe=yes
o.. + i -> oi=yes
o.. + m -> om=yes
o.. + n -> on=yes
o.. + g -> ong=yes
o.. + p -> op=yes
o.. + t -> ot=yes

Change syllables starting with ô=yes
ô choice index=0
ô.. + c -> ôc=yes
ô.. + i -> ôi=yes
ô.. + m -> ôm=yes
ô.. + n -> ôn=yes
ô.. + g -> ông=yes
ô.. + p -> ôp=yes
ô.. + t -> ôt=yes

Change syllables starting with ơ=yes
ơ choice index=0
ơ.. + i -> ơi=yes
ơ.. + m -> ơm=yes
ơ.. + n -> ơn=yes
ơ.. + p -> ơp=yes
ơ.. + t -> ơt=yes

Change syllables starting with uâ=yes
uâ choice index=0
uâ.. + n -> uân=yes
uâ.. + g -> uâng=yes
uâ.. + t -> uât=yes
uâ.. + y -> uây=yes

Change syllables starting with uô=yes
uô choice index=0
uô... + c -> uôc=yes
uô... + i -> uôi=yes
uô... + m -> uôm=yes
uô... + n -> uôn=yes
uô... + g -> uông=yes
uô... + t -> uôt=yes

Change syllables starting with uy=yes
uy choice index=0
uy.. + a -> uya=yes
uy.. + c -> uych=yes
uy.. + e -> uyê=yes
uy.. + h -> uynh=yes
uy.. + n -> uyên, uyênn->uyn, uychn->uynh=yes
uy.. + t -> uyêt, uyêtt->uyt=yes
uy.. + u -> uyu=yes

Change syllables starting with u=yes
u choice index=0
u... + a -> ua=yes
u... + c -> uc=yes
u... + i -> ui=yes
u... + m -> um=yes
u... + n -> un=yes
u... + g -> ung=yes
u... + p -> up=yes
u... + t -> ut=yes
u... + y -> uy=yes

Change syllables starting with ươ=yes
ươ choice index=0
ươ... + c -> ươc=yes
ươ... + i -> ươi=yes
ươ... + m -> ươm=yes
ươ... + n -> ươn=yes
ươ... + g -> ương=yes
ươ... + p -> ươp=yes
ươ... + t -> ươt=yes
ươ... + u -> ươu=yes

Change syllables starting with ư=yes
ư choice index=0
ư... + a -> ưa=yes
ư... + c -> ưc=yes
ư... + i -> ưi=yes
ư... + m -> ưm=yes
ư... + n -> ưn=yes
ư... + g -> ưng=yes
ư... + p -> ưp=yes
ư... + t -> ưt=yes
ư... + u -> ưu=yes

[Syllable Correction]

ToneOnStrongVowel=no
Autoadd ' to syllable=no,0
Autoadd second horn=yes
Autochange ưn->ưng=yes
Autoadd ^=yes
Autoadd ơ to ưm=yes
Autoadd ơ to ưp=yes
The following are applicable when option 5 (uncombine syllable) is unchecked=no
Autodelete breve=yes
Autodelete ^=yes
Autodelete horn=yes

[Word Correction]

Correct compound HoiNga=no
Correct HoiNga=yes,2
Missing mark=no
Add Acute=yes,1
Correct vowels=no
Add/del ê=yes,1
Add/del ô=yes,1
Add/del ơ=yes,1
Add/del circ=yes,1
Change I to i=no
Correct beginning consonants=no
Correct beginning s/x=yes,1
Change p->ph=yes,1
Correct ending consonants=no
Correct ending c/t=yes
Add/del g=yes,1
Add/del h=yes,1
Correct spacing=no
Correct word spacing=no
Correct sentence spacing=no
